<?php


return [
    'mir24_tags' => [
        8, // признак потока в бд мир24
    ],

    'categories_tv' => [
        ['id' => 1, 'name' => 'Кухни Мира'],
        ['id' => 2, 'name' => 'Мир.DOC'],
        ['id' => 3, 'name' => 'Непознанное или Загадки и тайны'],
        ['id' => 4, 'name' => 'Новости и аналитика'],
        ['id' => 5, 'name' => 'Сериалы'],
        ['id' => 6, 'name' => 'Телешоу'],
    ],

    // https://docs.google.com/spreadsheets/d/1lUCs35Z9zVLFH6Av_Yub1vKEDckFyXrJfmAwXxh0TMo/edit#gid=179830609
    // cat ./docs/Передачи\ МИР\ и\ МИР24\ -\ МИР\ архив.csv |perl -l -n -e "if( \$_ =~ m/^([^,]+),([^,]+?),/) { if(\$2) { print qq/['name' =\> '\$1', 'category' => '\$2'],/}}" |sort
    // cat ./docs/Передачи\ МИР\ и\ МИР24\ -\ МИР\ Премиум.csv |perl -l -n -e "if( \$_ =~ m/^([^,]+),.*,([^,]+?)\s*$/) { if(\$2) { print qq/['name' =\> '\$1', 'category' => '\$2'],/}}"
    'archives' => [
        ['name' => 'Аэромир', 'category' => 'Новости и аналитика'],
        ['name' => 'Беларусь сегодня', 'category' => 'Новости и аналитика'],
        ['name' => 'Бремя обеда', 'category' => 'Кухни Мира'],
        ['name' => 'В гостях у цифры', 'category' => 'Новости и аналитика'],
        ['name' => 'Вкусный мир с Анастасией Трегубовой', 'category' => 'Кухни Мира'],
        ['name' => 'Вместе', 'category' => 'Новости и аналитика'],
        ['name' => 'Во весь голос', 'category' => 'Телешоу'],
        ['name' => 'Всюду жизнь', 'category' => 'Мир.DOC'],
        ['name' => 'Второй дом', 'category' => 'Телешоу'],
        ['name' => 'Высокие отношения', 'category' => 'Телешоу'],
        ['name' => 'Дела семейные. Новые истории', 'category' => 'Телешоу'],
        ['name' => 'Дела семейные с Еленой Дмитриевой', 'category' => 'Телешоу'],
        ['name' => 'Держись, шоубиз!', 'category' => 'Новости и аналитика'],
        ['name' => 'Детский мир', 'category' => 'Телешоу'],
        ['name' => 'Диаспоры', 'category' => 'Мир.DOC'],
        ['name' => 'Дима, давай!', 'category' => 'Телешоу'],
        ['name' => 'Добро пожаловать', 'category' => 'Телешоу'],
        ['name' => 'Документальные фильмы', 'category' => 'Мир.DOC'],
        ['name' => 'Достучаться до звезды', 'category' => 'Телешоу'],
        ['name' => 'Евразия. Спорт', 'category' => 'Новости и аналитика'],
        ['name' => 'Еще дешевле', 'category' => 'Телешоу'],
        ['name' => 'Еще не вместе', 'category' => 'Телешоу'],
        ['name' => 'Звезда в подарок', 'category' => 'Телешоу'],
        ['name' => 'Здесь был я', 'category' => 'Мир.DOC'],
        ['name' => 'Земля и люди', 'category' => 'Телешоу'],
        ['name' => 'Земля и небо', 'category' => 'Телешоу'],
        ['name' => 'Земля. Территория загадок', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Знаем русский', 'category' => 'Телешоу'],
        ['name' => 'Игра в кино', 'category' => 'Телешоу'],
        ['name' => 'Истории из жизни', 'category' => 'Телешоу'],
        ['name' => 'История с географией', 'category' => 'Телешоу'],
        ['name' => 'Казахстан завтра', 'category' => 'Новости и аналитика'],
        ['name' => 'Казахстан. Легенды степи', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Казахстан: Легенды степи', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Казахстан: легенды степи', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Как дела?', 'category' => 'Мир.DOC'],
        ['name' => 'Кошмар большого города (бывший Трэш-тест)', 'category' => 'Телешоу'],
        ['name' => 'Культпросвет', 'category' => 'Новости и аналитика'],
        ['name' => 'Культ//Туризм', 'category' => 'Новости и аналитика'],
        ['name' => 'Любовь без границ', 'category' => 'Телешоу'],
        ['name' => 'Медицинская правда', 'category' => 'Телешоу'],
        ['name' => 'Мечтай! Действуй! Будь!', 'category' => 'Телешоу'],
        ['name' => 'Миллион вопросов о природе', 'category' => 'Телешоу'],
        ['name' => 'Мой лучший друг', 'category' => 'Телешоу'],
        ['name' => 'Нано на здоровье', 'category' => 'Телешоу'],
        ['name' => 'Народы России', 'category' => 'Мир.DOC'],
        ['name' => 'Наша марка', 'category' => 'Мир.DOC'],
        ['name' => 'На шашлыки!', 'category' => 'Кухни Мира'],
        ['name' => 'Наше кино. История большой любви', 'category' => 'Телешоу'],
        ['name' => 'Наши иностранцы', 'category' => 'Телешоу'],
        ['name' => 'Нет проблем', 'category' => 'Телешоу'],
        ['name' => 'Новости', 'category' => 'Новости и аналитика'],
        ['name' => 'Новости культуры', 'category' => 'Новости и аналитика'],
        ['name' => 'О Беларуси с акцентом', 'category' => 'Новости и аналитика'],
        ['name' => 'Общий интерес', 'category' => 'Новости и аналитика'],
        ['name' => 'Общий рынок', 'category' => 'Новости и аналитика'],
        ['name' => 'Ой, мамочки!', 'category' => 'Телешоу'],
        ['name' => 'О чем не принято говорить', 'category' => 'Телешоу'],
        ['name' => 'По душам с Владимиром Молчановым', 'category' => 'Телешоу'],
        ['name' => 'Полуночники с Владимиром Молчановым', 'category' => 'Телешоу'],
        ['name' => 'Почему я', 'category' => 'Телешоу'],
        ['name' => 'Преступление и наказание', 'category' => 'Новости и аналитика'],
        ['name' => 'Приключения Македонской', 'category' => 'Телешоу'],
        ['name' => 'Простые числа', 'category' => 'Новости и аналитика'],
        ['name' => 'Путеводитель', 'category' => 'Телешоу'],
        ['name' => 'Пять причин поехать в ...', 'category' => 'Телешоу'],
        ['name' => 'Пять причин поехать в…', 'category' => 'Телешоу'],
        ['name' => 'Развод', 'category' => 'Сериалы'],
        ['name' => 'Республика сегодня', 'category' => 'Новости и аналитика'],
        ['name' => 'Свои люди', 'category' => 'Телешоу'],
        ['name' => 'Сделано в СССР', 'category' => 'Телешоу'],
        ['name' => 'Секретные материалы', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Сильнее судьбы', 'category' => 'Телешоу'],
        ['name' => 'Скажите, почему?', 'category' => 'Телешоу'],
        ['name' => 'Слово за слово', 'category' => 'Телешоу'],
        ['name' => 'С миру по нитке', 'category' => 'Телешоу'],
        ['name' => 'Содружество. LIVE', 'category' => 'Мир.DOC'],
        ['name' => 'Содружество – это мы', 'category' => 'Мир.DOC'],
        ['name' => 'Специальный репортаж', 'category' => 'Мир.DOC'],
        ['name' => 'Столицы в лицах', 'category' => 'Мир.DOC'],
        ['name' => 'Тайны времени', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Тайны Эрмитажа', 'category' => 'Непознанное или Загадки и тайны'],
        ['name' => 'Такие разные', 'category' => 'Телешоу'],
        ['name' => 'Такие странные', 'category' => 'Телешоу'],
        ['name' => 'Технология прорыва', 'category' => 'Мир.DOC'],
        ['name' => 'Хит-экспресс', 'category' => 'Телешоу'],
        ['name' => 'Школа выживания от одинокой женщины с тремя детьми в условиях кризиса', 'category' => 'Сериалы'],
        ['name' => 'Экспериментаторы', 'category' => 'Телешоу'],
        ['name' => 'Я – волонтер', 'category' => 'Телешоу'],
    ],

    'streams' => [
        [
            'name' => 'МИР ПРЕМИУМ',
            'id_in_mir24' => 15363866,
            'id_in_api' => 1,
            'stream_shift' => '',
            'stream_live' => 'http://hls.mirtv.cdnvideo.ru/mirtv-parampublish/hd/playlist.m3u8',
            'logo' => 'http://onair.mir24.tv/images/custom/logo.png',
        ]
    ],

    'tv_program_end_period' => 10080, // одна неделя в минутах (начинаем с программы недельной давности )

    'archive' => [
        'start_date' => '2018-01-01 00:00:00', // формат для mysql
        'video_pattern_1' => 'http://mirtv.ru/files/video/%s/%s', // для sprintf()
        'video_pattern_2' => 'http://mir24.tv/video/content/%s',
        'image_pattern_broadcast' => 'http://mirtv.ru/files/broadcast/%s/%s',
        'image_pattern_broadcast_default' => 'http://mirtv.ru/files/broadcast/%s/main.jpg',
        'image_pattern_episode' => 'http://mirtv.ru/files/video/%s/%s',

    ]
];

